Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_BEMFComparators_F16_TLE987.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/**
 *
 * \file Ifx_MHA_BEMFComparators_F16_TLE987.c
 * \brief A specialized Back EMF control module for the TLE987x devices
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_MHA_BEMFComparators_F16_TLE987.h"

/* SDK */
#include "bdrv.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Macros to define the component ID */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_SOURCEID \
    ((uint8_t)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_LIBRARYID \
    ((uint16_t)Ifx_ComponentID_LibraryID_mctrlHardwareAbstraction)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_MODULEID     (4U)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_COMPONENTID1 (0U)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_COMPONENTID2 ((uint8_t)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_MAJOR   (1U)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_MINOR   (0U)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_PATCH   (0U)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_T       (4U)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_REV     (0U)
/* *INDENT-ON* */
/* Map back emf sector WVU to real sector */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_0           (2) /* 010 */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_1           (6) /* 110 */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_2           (4) /* 100 */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_3           (5) /* 101 */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_4           (1) /* 001 */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_5           (3) /* 011 */

#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_ZC_MASK            7U
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_ZC_SHIFT           16U

/* Counter thresholds */
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX   (10)
#define IFX_MHA_BEMFCOMPARATORS_F16_TLE987_STANDSTILL_CTR_MAX (1000)

/******************************************************************************/
/*------------------------Private Variables/Constants-------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MHA_BEMFComparators_F16_TLE987_componentID = {
    .sourceID     = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_MODULEID,
    .componentID1 = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MHA_BEMFComparators_F16_TLE987_componentVersion = {
    .major = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_MAJOR,
    .minor = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_MINOR,
    .patch = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_PATCH,
    .t     = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_T,
    .rev   = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_COMPONENTVERSION_REV
};
/* *INDENT-ON* */
/******************************************************************************/
/*-----------------------Static Function Prototypes---------------------------*/
/******************************************************************************/

/**
 * \brief Update the sector information
 *
 * This function maps the back emf comparator status to a sector value between 0 and 5
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_updateSector(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Function called in the init state
 *
 * This function disables the back emf comparator and sets the next state to off
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateInit(
    Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Function called in the off state
 *
 * This function sets the next state to the debounce state if the module is enabled and
 * enables the hardware comparators.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateOff(
    Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Function called in debounce state
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateDebounce(
    Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Check state transition in debounce state
 *
 * This function handles the transition of the debounce state. If the module is disabled the next state is set to off
 * and the hardware comparators are disabled. If the debounce counter reaches the positive maximum then the next state
 * is set to onPos and the internal flag isSignalValid is set to true. If the debounce counter reaches the negative
 * maximum the next state is set to onNeg and the internal flag isSignalValid is set to true.
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_transitionStateDebounce(
    Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Increment/decrement debounce counter
 *
 * This function updates the debounce counter on a sector change. If the sector change is in the positive direction then
 * the counter is incremented, otherwise it is decremented.
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_doStateDebounce(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Function called in the onPos and onNeg State
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateOn(
    Ifx_MHA_BEMFComparators_F16_TLE987* self, Ifx_MHA_BEMFComparators_F16_TLE987_State actualState);

/**
 * \brief Check state transition in onPos and onNeg state
 *
 * This function sets the next state to the off state if the module is disabled, disables the hardware comparators, and
 * sets the output to 0 and flag isSignalValid to false. If the standstill counter or debouce counter have run out, the
 * counters are reset to their default values, the output is set to 0, the internal flag isSignalValid is set to false
 * and the next state is set to debounce.
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_transitionStateOn(
    Ifx_MHA_BEMFComparators_F16_TLE987* self, Ifx_MHA_BEMFComparators_F16_TLE987_State actualState);

/**
 * \brief Update Comparator state and debounce counter in onPos state.
 *
 * This function checks the new sector and on a positive sector change reads the comparator status, increments and
 * saturates the debounce counter. It decrements the debounce counter on a negative sector change. In addition, it
 * resets the standstill counter on any sector change, and decrements it when no sector change occurs.
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_doStateOnPos(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Update Comparator state and debounce counter in onNeg state.
 *
 * This function checks the new sector and on a negative sector change reads the comparator status, decrements and
 * saturates the debounce counter. It increments the debounce counter on a positive sector change. In addition, it
 * resets the standstill counter on any sector change, and decrements it when no sector change occurs.
 *
 * \param [inout] self Reference to structure that contains instance data members
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_doStateOnNeg(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Read status of 3 bemf comparators
 *
 *  \param [out] bemfComparatorState state of comparators u,v,w
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_readComparatorStatus(
    Ifx_Math_3PhaseFract16* bemfComparatorState);

/**
 * \brief Set signal invalid
 *
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_setSignalInvalid(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Enable/disable the hardware comparators
 *
 * \param [in] enable Parameter of boolean type to enable or disable the hardware comparators
 */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_enableComparator(bool enable);

/**
 * \brief Increment the sector with overflow
 *
 * Increments the old sector value and returns the result. If the result of the increment is 6, then
 * 0 is returned.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline uint8_t Ifx_MHA_BEMFComparators_F16_TLE987_incSector(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/**
 * \brief Decrement the sector with overflow
 *
 * Decrements the old sector value and returns the result. If the result of the increment is -1, then
 * 5 is returned.
 *
 *  \param [inout] self Reference to structure that contains instance data members
 */
static inline uint8_t Ifx_MHA_BEMFComparators_F16_TLE987_decSector(Ifx_MHA_BEMFComparators_F16_TLE987* self);

/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/
/* Function to get the component ID */
void Ifx_MHA_BEMFComparators_F16_TLE987_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MHA_BEMFComparators_F16_TLE987_componentID;
}


