Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_BEMFComparators_F16_TLE987.c
/* Function to get the component version */
void Ifx_MHA_BEMFComparators_F16_TLE987_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MHA_BEMFComparators_F16_TLE987_componentVersion;
}


static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateInit(
    Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    (void)self;

    /* Disable HW comparators */
    Ifx_MHA_BEMFComparators_F16_TLE987_enableComparator(false);

    /* Variable to store the next state */
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_off;

    /* Return next state */
    return nextState;
}


static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateOff(
    Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Variable to store the next state */
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState;

    /* Check enable */
    if (self->enable == true)
    {
        /* Enable HW comparators */
        Ifx_MHA_BEMFComparators_F16_TLE987_enableComparator(true);

        /* Go to debouncing */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_debounce;
    }
    else
    {
        /* Stay in off state */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_off;
    }

    /* Return next state */
    return nextState;
}


static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateDebounce(
    Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState;
    nextState = Ifx_MHA_BEMFComparators_F16_TLE987_transitionStateDebounce(self);

    if (nextState == Ifx_MHA_BEMFComparators_F16_TLE987_State_debounce)
    {
        Ifx_MHA_BEMFComparators_F16_TLE987_doStateDebounce(self);
    }

    /* Return next state */
    return nextState;
}


static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_transitionStateDebounce(
    Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Variable to store the next state */
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState;

    /* Check enable */
    if (self->enable == false)
    {
        /* Disable HW comparators */
        Ifx_MHA_BEMFComparators_F16_TLE987_enableComparator(false);

        /* Go to state off */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_off;
    }
    else if (self->debounceCounter == IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX)
    {
        /* Set signal valid to true */
        self->status.isSignalValid = true;

        /* Go to positive On state */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_onPos;
    }
    else if (self->debounceCounter == -IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX)
    {
        /* Set signal valid to true */
        self->status.isSignalValid = true;

        /* Go to negative On state */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_onNeg;
    }
    else
    {
        /* Stay in debounce state */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_debounce;
    }

    /* Return next state */
    return nextState;
}


static inline void Ifx_MHA_BEMFComparators_F16_TLE987_doStateDebounce(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Increment/decrement debounce counter on sector change */
    if (self->actualSector != self->oldSector)
    {
        if (self->actualSector == Ifx_MHA_BEMFComparators_F16_TLE987_incSector(self))
        {
            /* Increment debounce counter */
            self->debounceCounter = self->debounceCounter + 1;
        }
        else
        {
            /* Decrement debounce counter */
            self->debounceCounter = self->debounceCounter - 1;
        }
    }
}


static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_stateOn(
    Ifx_MHA_BEMFComparators_F16_TLE987* self, Ifx_MHA_BEMFComparators_F16_TLE987_State actualState)
{
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState;
    nextState = Ifx_MHA_BEMFComparators_F16_TLE987_transitionStateOn(self, actualState);

    if (nextState == actualState)
    {
        if (nextState == Ifx_MHA_BEMFComparators_F16_TLE987_State_onPos)
        {
            Ifx_MHA_BEMFComparators_F16_TLE987_doStateOnPos(self);
        }
        else
        {
            Ifx_MHA_BEMFComparators_F16_TLE987_doStateOnNeg(self);
        }
    }

    /* Return next state */
    return nextState;
}


static inline Ifx_MHA_BEMFComparators_F16_TLE987_State Ifx_MHA_BEMFComparators_F16_TLE987_transitionStateOn(
    Ifx_MHA_BEMFComparators_F16_TLE987* self, Ifx_MHA_BEMFComparators_F16_TLE987_State actualState)
{
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState;

    /* Check enable */
    if (self->enable == false)
    {
        Ifx_MHA_BEMFComparators_F16_TLE987_setSignalInvalid(self);

        /* Disable HW comparators */
        Ifx_MHA_BEMFComparators_F16_TLE987_enableComparator(false);

        /* Go to off state */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_off;
    }
    else if ((self->debounceCounter == 0)
             || (self->standstillCounter == 0))
    {
        Ifx_MHA_BEMFComparators_F16_TLE987_setSignalInvalid(self);

        /* Reset debounce counter in case transition due to standstill */
        self->debounceCounter = 0;

        /* Reset standstill counter */
        self->standstillCounter = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_STANDSTILL_CTR_MAX;

        /* Go to debounce state */
        nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_debounce;
    }
    else
    {
        nextState = actualState;
    }

    return nextState;
}


static inline void Ifx_MHA_BEMFComparators_F16_TLE987_doStateOnPos(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* On sector change */
    if (self->actualSector != self->oldSector)
    {
        if (self->actualSector == Ifx_MHA_BEMFComparators_F16_TLE987_incSector(self))
        {
            Ifx_MHA_BEMFComparators_F16_TLE987_readComparatorStatus(&(self->bemfComparatorState));

            /* We rotate in positive direction. Increment debounce counter */
            self->debounceCounter = self->debounceCounter + 1;

            /* Saturate debounce counter */
            if (self->debounceCounter > IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX)
            {
                self->debounceCounter = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX;
            }
        }
        else
        {
            /* False sector: */
            /* We rotate in negative direction. Decrement debounce counter */
            self->debounceCounter = self->debounceCounter - 1;
        }

