Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_BEMFComparators_F16_TLE987.c
        /* Reset standstill counter */
        self->standstillCounter = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_STANDSTILL_CTR_MAX;
    }
    else
    {
        /* Decrement standstill counter */
        self->standstillCounter = self->standstillCounter - 1;
    }
}


static inline void Ifx_MHA_BEMFComparators_F16_TLE987_doStateOnNeg(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* On sector change */
    if (self->actualSector != self->oldSector)
    {
        if (self->actualSector == Ifx_MHA_BEMFComparators_F16_TLE987_decSector(self))
        {
            Ifx_MHA_BEMFComparators_F16_TLE987_readComparatorStatus(&(self->bemfComparatorState));

            /* Decrement debounce counter */
            self->debounceCounter = self->debounceCounter - 1;

            /* Saturate debounce counter */
            if (self->debounceCounter < -IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX)
            {
                self->debounceCounter = -IFX_MHA_BEMFCOMPARATORS_F16_TLE987_DEBOUNCE_CTR_MAX;
            }
        }
        else
        {
            /* False sector: */
            /* Increment debounce counter */
            self->debounceCounter = self->debounceCounter + 1;
        }

        /* Reset standstill counter */
        self->standstillCounter = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_STANDSTILL_CTR_MAX;
    }
    else
    {
        /* Decrement standstill counter */
        self->standstillCounter = self->standstillCounter - 1;
    }
}


static inline uint8_t Ifx_MHA_BEMFComparators_F16_TLE987_decSector(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Temp. variable to hold next sector */
    int16_t sector = (int16_t)self->oldSector - 1;

    /* Sector is only 0 to 5 */
    if (sector == -1)
    {
        sector = 5;
    }

    return (uint8_t)sector;
}


static inline void Ifx_MHA_BEMFComparators_F16_TLE987_readComparatorStatus(
    Ifx_Math_3PhaseFract16* bemfComparatorState)
{
    bemfComparatorState->u = (Ifx_Math_Fract16)(MF->BEMFC_CTRL_STS.bit.PHU_ZC_STS);
    bemfComparatorState->v = (Ifx_Math_Fract16)(MF->BEMFC_CTRL_STS.bit.PHV_ZC_STS);
    bemfComparatorState->w = (Ifx_Math_Fract16)(MF->BEMFC_CTRL_STS.bit.PHW_ZC_STS);
}


static inline void Ifx_MHA_BEMFComparators_F16_TLE987_setSignalInvalid(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    self->status.isSignalValid  = false;
    self->bemfComparatorState.u = 0;
    self->bemfComparatorState.v = 0;
    self->bemfComparatorState.w = 0;
}


static inline void Ifx_MHA_BEMFComparators_F16_TLE987_updateSector(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Variable which holds comparators status as integer */
    uint32_t zeroCrossingStatus;

    /* Store actual sector */
    self->oldSector = self->actualSector;

    /* MF->BEMFC_CTRL_STS.reg 32 bit register
     * bits          description
     * 31:19         always read as 0
     * 18            phase W Comparator zero crossing status
     * 17            phase V Comparator zero crossing status
     * 16            phase U Comparator zero crossing status
     * 15:0          other fields */
    zeroCrossingStatus = ((MF->BEMFC_CTRL_STS.reg >> IFX_MHA_BEMFCOMPARATORS_F16_TLE987_ZC_SHIFT) &
                          (IFX_MHA_BEMFCOMPARATORS_F16_TLE987_ZC_MASK));

    /* Map comparator state to real sector */
    switch (zeroCrossingStatus)
    {
        case IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_0:
            self->actualSector = 0;
            break;

        case IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_1:
            self->actualSector = 1;
            break;

        case IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_2:
            self->actualSector = 2;
            break;

        case IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_3:
            self->actualSector = 3;
            break;

        case IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_4:
            self->actualSector = 4;
            break;

        case IFX_MHA_BEMFCOMPARATORS_F16_TLE987_SECTOR_5:
            self->actualSector = 5;
            break;

        default:
            self->actualSector = self->oldSector;
            break;
    }
}


/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "Function is setting 6 single bits there is no reduction in
 * complexity possible" */
static inline void Ifx_MHA_BEMFComparators_F16_TLE987_enableComparator(bool enable)
{
    /* Enable Comparators */
    MF->BEMFC_CTRL_STS.bit.PHUCOMP_EN = (uint8_t)enable;
    MF->BEMFC_CTRL_STS.bit.PHVCOMP_EN = (uint8_t)enable;
    MF->BEMFC_CTRL_STS.bit.PHWCOMP_EN = (uint8_t)enable;

    /* Switch Comparators On */
    MF->BEMFC_CTRL_STS.bit.PHUCOMP_ON = (uint8_t)enable;
    MF->BEMFC_CTRL_STS.bit.PHVCOMP_ON = (uint8_t)enable;
    MF->BEMFC_CTRL_STS.bit.PHWCOMP_ON = (uint8_t)enable;
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Function is setting 6 single bits there is no reduction in complexity
 * possible" */
static inline uint8_t Ifx_MHA_BEMFComparators_F16_TLE987_incSector(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Temp. variable to hold next sector */
    uint8_t sector = self->oldSector + 1;

    /* Sector is only 0 to 5 */
    if (sector == 6)
    {
        sector = 0;
    }

    return sector;
}


void Ifx_MHA_BEMFComparators_F16_TLE987_init(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Init internal variables */
    self->enable            = false;
    self->status.state      = Ifx_MHA_BEMFComparators_F16_TLE987_State_init;
    self->oldSector         = 0;
    self->actualSector      = 0;
    self->debounceCounter   = 0;
    self->standstillCounter = IFX_MHA_BEMFCOMPARATORS_F16_TLE987_STANDSTILL_CTR_MAX;
    Ifx_MHA_BEMFComparators_F16_TLE987_setSignalInvalid(self);
}


void Ifx_MHA_BEMFComparators_F16_TLE987_execute(Ifx_MHA_BEMFComparators_F16_TLE987* self)
{
    /* Variable to store the previous state */
    Ifx_MHA_BEMFComparators_F16_TLE987_State actualState = self->status.state;

    /* Variable to store the next state */
    Ifx_MHA_BEMFComparators_F16_TLE987_State nextState;

    /* Update sector when not in off state */
    if (actualState != Ifx_MHA_BEMFComparators_F16_TLE987_State_off)
    {
        Ifx_MHA_BEMFComparators_F16_TLE987_updateSector(self);
    }

    switch (actualState)
    {
        /* State machine is in init state */
        case Ifx_MHA_BEMFComparators_F16_TLE987_State_init:
            nextState = Ifx_MHA_BEMFComparators_F16_TLE987_stateInit(self);
            break;

        /* State machine is in off state */
        case Ifx_MHA_BEMFComparators_F16_TLE987_State_off:
            nextState = Ifx_MHA_BEMFComparators_F16_TLE987_stateOff(self);
            break;

        /* State machine is in debounce state */
        case Ifx_MHA_BEMFComparators_F16_TLE987_State_debounce:
            nextState = Ifx_MHA_BEMFComparators_F16_TLE987_stateDebounce(self);
            break;

        /* State machine is in On positive rotation state */
        case Ifx_MHA_BEMFComparators_F16_TLE987_State_onPos:
            nextState = Ifx_MHA_BEMFComparators_F16_TLE987_stateOn(self, actualState);
            break;

        /* State machine is in On negative rotation state */
        case Ifx_MHA_BEMFComparators_F16_TLE987_State_onNeg:
            nextState = Ifx_MHA_BEMFComparators_F16_TLE987_stateOn(self, actualState);
            break;

        /* do default transition to init */
        default:
            nextState = Ifx_MHA_BEMFComparators_F16_TLE987_State_init;
            break;
    }

    /* Update state and reset clear fault */
    self->status.state = nextState;
}
